blog/19.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-26 Wed 22:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 2.3.3 Example: Representing Sets</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 2.3.3 Example: Representing Sets</h1>
<blockquote>
<p>
``Informally, a set is simply a collection of distinct objects''.
</p>
</blockquote>
<p>
Sets can be defined more precisely by employing the method of data
abstraction; that is, by specifying the operations that can be used on
them: <code>union-set</code>, <code>intersection-set</code>, <code>element-of-set?</code> and
<code>adjoin-set</code>.
</p>

<div id="outline-container-org71a6bbc" class="outline-2">
<h2 id="org71a6bbc">Sets as unordered lists</h2>
<div class="outline-text-2" id="text-org71a6bbc">
<blockquote>
<p>
``One way to represent a set is a list of its elements in which no
element appears more than once'':
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">element-of-set?</span> x set)
  (<span style="color: #b9ca4a;">cond</span> ((null? set) false)
        ((equal? x (car set)) true)
        (<span style="color: #b9ca4a;">else</span> (element-of-set? x (cdr set)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">adjoin-set</span> x set)
  (<span style="color: #b9ca4a;">if</span> (element-of-set? x set)
      set
      (cons x set)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">intersection-set</span> set1 set2)
  (<span style="color: #b9ca4a;">cond</span> ((<span style="color: #b9ca4a;">or</span> (null? set1) (null? set2)) 
         '())
        ((element-of-set? (car set1) set2)
         (cons (car set1)
               (intersection-set (cdr set1) 
                                 set2)))
        (<span style="color: #b9ca4a;">else</span> (intersection-set (cdr set1) 
                                set2))))
</pre>
</div>

<p>
The number of steps required by <code>element-of-set</code> grows as
\(\Theta(n)\). The number of steps required by <code>adjoin-set</code> too. The
number of steps required by <code>intersection-set</code> grows as \(\Theta(n^2)\).
</p>
</div>

<div id="outline-container-org995e7fa" class="outline-3">
<h3 id="org995e7fa">Exercise 2.59</h3>
<div class="outline-text-3" id="text-org995e7fa">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Implement the <code>union-set</code> operation for the unordered-list
representation of sets.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">union-set</span> s1 s2)
  (<span style="color: #b9ca4a;">cond</span> ((null? s1) s2)
        ((null? s2) s1)
        ((element-of-set? (car s1) s2)
         (union-set (cdr s1) s2))
        (<span style="color: #b9ca4a;">else</span> (cons (car s1)
                    (union-set (cdr s1) s2)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge186899" class="outline-3">
<h3 id="orge186899">Exercise 2.60</h3>
<div class="outline-text-3" id="text-orge186899">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
We specified that a set would be represented as a list with no
duplicates. Now suppose we allow duplicates. For instance, the set
\({1,2,3}\) could be represented as the list <code>(2 3 2 1 3 2 2)</code>. Design
procedures <code>element-of-set?</code>, <code>adjoin-set</code>, <code>union-set</code>, and
<code>intersection-set</code> that operate on this representation. How does the
efficiency of each compare with the corresponding procedure for the
non-duplicate representation? Are there applications for which you
would use this representation in preference to the non-duplicate one?
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
I wouldn't change neither <code>element-of-set?</code> nor <code>intersection-set</code>. So
their complexity remains the same; respectively, linear and
exponential.
</p>

<p>
This is the way I would write <code>adjoin-set</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">adjoin-set</span> x set)
  (cons x set))
</pre>
</div>

<p>
Its complexity is constant. We just have to do one operation,
regardless of the size of the set.
</p>

<p>
This is the way I would write <code>union-set</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">union-set</span> s1 s2)
  (<span style="color: #b9ca4a;">if</span> ((null? s1) s2)
      (<span style="color: #b9ca4a;">else</span> (cons (car s1)
                  (union-set (cdr s1) s2)))))
</pre>
</div>

<p>
Its complexity is linear. We have to go through each element of one of
the two lists.
</p>
</div>
</div>
</div>
<div id="outline-container-org1b6268f" class="outline-2">
<h2 id="org1b6268f">Sets as ordered lists</h2>
<div class="outline-text-2" id="text-org1b6268f">
<p>
Representing sets with ordered sequences allows use to speed up our
operations. For example, <code>element-of-set?</code> doesn't necessarily have to
scan the entire set anymore:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">element-of-set?</span> x set)
  (<span style="color: #b9ca4a;">cond</span> ((null? set) false)
        ((= x (car set)) true)
        ((&lt; x (car set)) false)
        (<span style="color: #b9ca4a;">else</span> (element-of-set? x (cdr set)))))
</pre>
</div>

<p>
The average number of step is about \(n/2\) (which is still \(\Theta(n)\)
growth).
</p>

<p>
The authors present a ``more impressive speedup with
<code>intersection-set</code>'':
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">intersection-set</span> set1 set2)
  (<span style="color: #b9ca4a;">if</span> (<span style="color: #b9ca4a;">or</span> (null? set1) (null? set2))
      '()
      (<span style="color: #b9ca4a;">let</span> ((x1 (car set1)) (x2 (car set2)))
        (<span style="color: #b9ca4a;">cond</span> ((= x1 x2)
               (cons x1 (intersection-set 
                         (cdr set1)
                         (cdr set2))))
              ((&lt; x1 x2) (intersection-set 
                          (cdr set1) 
                          set2))
              ((&lt; x2 x1) (intersection-set 
                          set1 
                          (cdr set2)))))))
</pre>
</div>

<p>
The <code>intersection-set</code> above grows linearly.
</p>
</div>
<div id="outline-container-org5412c3b" class="outline-3">
<h3 id="org5412c3b">Exercise 2.61</h3>
<div class="outline-text-3" id="text-org5412c3b">
<p>
<b>Exercise</b>":
</p>

<blockquote>
<p>
Give an implementation of <code>adjoin-set</code> using the ordered
representation. By analogy with <code>element-of-set?</code> show how to take
advantage of the ordering to produce a procedure that requires on the
average about half as many steps as with the unordered representation.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">adjoin-set</span> x set)
  (<span style="color: #b9ca4a;">cond</span> ((null? set) (cons x set))
        ((= x (car set)) set)
        ((&lt; x (car set)) (cons x set))
        (<span style="color: #b9ca4a;">else</span> (cons (car set)
                    (adjoin-set x (cdr set))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8ba7265" class="outline-3">
<h3 id="org8ba7265">Exercise 2.62</h3>
<div class="outline-text-3" id="text-org8ba7265">
<p>
<b>Exercise</b>":
</p>

<blockquote>
<p>
Give a \(\Theta(n)\) implementation of union-set for sets represented as
ordered lists.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">union-set</span> s1 s2)
  (<span style="color: #b9ca4a;">cond</span> ((null? s1) s2)
        ((null? s2) s1)
        ((= (car s1) (car s2)) (cons (car s1)
                                     (union-set (cdr s1)
                                                (cdr s2))))
        ((&lt; (car s1) (car s2)) (cons (car s1)
                                     (union-set (cdr s1)
                                                s2)))
        ((&lt; (car s2) (car s1)) (cons (car s2)
                                     (union-set s1
                                                (cdr s2))))))
</pre>
</div>
</div>
</div>
</div>
