blog/19.org
* Sets as binary trees
We can represent a set in terms of a tree (which are, in turn,
represented by us in terms of lists). Each node of the tree has an
entry, a left branch and a right branch. The left branch's entry must
be smaller than the entry, while the right branch's entry must be
greater.

Given the tree representation, we can have an ~element-of-set?~  with
$\Theta(\log n)$ order of growth...

#+begin_src scheme
  (define (entry tree) (car tree))
  (define (left-branch tree) (cadr tree))
  (define (right-branch tree) (caddr tree))
  (define (make-tree entry left right)
    (list entry left right))
#+end_src

#+begin_src scheme
  (define (element-of-set? x set)
    (cond ((null? set) false)
          ((= x (entry set)) true)
          ((< x (entry set))
           (element-of-set? 
            x 
            (left-branch set)))
          ((> x (entry set))
           (element-of-set? 
            x 
            (right-branch set)))))
#+end_src

#+begin_src scheme
  (define (adjoin-set x set)
    (cond ((null? set) (make-tree x '() '()))
          ((= x (entry set)) set)
          ((< x (entry set))
           (make-tree 
            (entry set)
            (adjoin-set x (left-branch set))
            (right-branch set)))
          ((> x (entry set))
           (make-tree
            (entry set)
            (left-branch set)
            (adjoin-set x (right-branch set))))))
#+end_src

Adjoining an item in this way requires $\Theta(\log n)$ steps.

** Exercise 2.63
*Exercise*:
#+begin_quote
Each of the following two procedures converts a binary tree to a list.

#+begin_src 
(define (tree->list-1 tree)
  (if (null? tree)
      '()
      (append 
       (tree->list-1 
        (left-branch tree))
       (cons (entry tree)
             (tree->list-1 
              (right-branch tree))))))

(define (tree->list-2 tree)
  (define (copy-to-list tree result-list)
    (if (null? tree)
        result-list
        (copy-to-list 
         (left-branch tree)
         (cons (entry tree)
               (copy-to-list 
                (right-branch tree)
                result-list)))))
  (copy-to-list tree '()))
#+end_src

1. Do the two procedures produce the same result for every tree? If
   not, how do the results differ? What lists do the two procedures
   produce for the trees in Figure 2.16?
2. Do the two procedures have the same order of growth in the number
   of steps required to convert a balanced tree with $n$ elements to a
   list? If not, which one grows more slowly?
#+end_quote

*Answer*:

#+begin_src scheme
  (define (entry tree) (car tree))
  (define (left-branch tree) (cadr tree))
  (define (right-branch tree) (caddr tree))
  (define (make-tree entry left right)
    (list entry left right))

  (define (element-of-set? x set)
    (cond ((null? set) false)
          ((= x (entry set)) true)
          ((< x (entry set))
           (element-of-set?
            x
            (left-branch set)))
          ((> x (entry set))
           (element-of-set?
            x
            (right-branch set)))))

  (define (adjoin-set x set)
    (cond ((null? set) (make-tree x '() '()))
          ((= x (entry set)) set)
          ((< x (entry set))
           (make-tree
            (entry set)
            (adjoin-set x (left-branch set))
            (right-branch set)))
          ((> x (entry set))
           (make-tree
            (entry set)
            (left-branch set)
            (adjoin-set x (right-branch set))))))


  (define (tree->list-1 tree)
    (if (null? tree)
        '()
        (append
         (tree->list-1
          (left-branch tree))
         (cons (entry tree)
               (tree->list-1
                (right-branch tree))))))

  (define (tree->list-2 tree)
    (define (copy-to-list tree result-list)
      (if (null? tree)
          result-list
          (copy-to-list
           (left-branch tree)
           (cons (entry tree)
                 (copy-to-list
                  (right-branch tree)
                  result-list)))))
    (copy-to-list tree '()))

  (tree->list-1 (make-tree 7
                           (make-tree 3
                                      (make-tree 1 nil nil)
                                      (make-tree 5 nil nil))
                           (make-tree 9
                                      nil
                                      (make-tree 11 nil nil))))
  ;; => (1 3 5 7 9 11)

  (tree->list-2 (make-tree 7
                           (make-tree 3
                                      (make-tree 1 nil nil)
                                      (make-tree 5 nil nil))
                           (make-tree 9
                                      nil
                                      (make-tree 11 nil nil))))
  ;; => (1 3 5 7 9 11)

  (tree->list-1 (make-tree 3
                           (make-tree 1 nil nil)
                           (make-tree 7
                                      (make-tree 5 nil nil)
                                      (make-tree 9
                                                 nil
                                                 (make-tree 11 nil nil)))))
  ;; => (1 3 5 7 9 11)

  (tree->list-2 (make-tree 3
                           (make-tree 1 nil nil)
                           (make-tree 7
                                      (make-tree 5 nil nil)
                                      (make-tree 9
                                                 nil
                                                 (make-tree 11 nil nil)))))
  ;; => (1 3 5 7 9 11)

  (tree->list-1 (make-tree 5
                           (make-tree 3
                                      (make-tree 1 nil nil)
                                      nil)
                           (make-tree 9
                                      (make-tree 7 nil nil)
                                      (make-tree 11 nil nil))))
  ;; => (1 3 5 7 9 11)

  (tree->list-2 (make-tree 5
                           (make-tree 3
                                      (make-tree 1 nil nil)
                                      nil)
                           (make-tree 9
                                      (make-tree 7 nil nil)
                                      (make-tree 11 nil nil))))
  ;; => (1 3 5 7 9 11)

#+end_src

It looks like tree->list-1 and tree->list-2 give always the same
result.

In time, they seem to grow at the same pace (Are you sure? Doesn't the
append in tree->list-1 makes it grow faster?).

In space, tree->list-2 seems to grow more slowly, because one the two
recursive calls is a tail call (scheme optimizes in that case).

