blog/19.html

<div id="outline-container-orgf2110a4" class="outline-2">
<h2 id="orgf2110a4">Sets as binary trees</h2>
<div class="outline-text-2" id="text-orgf2110a4">
<p>
We can represent a set in terms of a tree (which are, in turn,
represented by us in terms of lists). Each node of the tree has an
entry, a left branch and a right branch. The left branch's entry must
be smaller than the entry, while the right branch's entry must be
greater.
</p>

<p>
Given the tree representation, we can have an <code>element-of-set?</code>  with
\(\Theta(\log n)\) order of growth&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">entry</span> tree) (car tree))
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">left-branch</span> tree) (cadr tree))
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">right-branch</span> tree) (caddr tree))
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">make-tree</span> entry left right)
  (list entry left right))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">element-of-set?</span> x set)
  (<span style="color: #b9ca4a;">cond</span> ((null? set) false)
        ((= x (entry set)) true)
        ((&lt; x (entry set))
         (element-of-set? 
          x 
          (left-branch set)))
        ((&gt; x (entry set))
         (element-of-set? 
          x 
          (right-branch set)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">adjoin-set</span> x set)
  (<span style="color: #b9ca4a;">cond</span> ((null? set) (make-tree x '() '()))
        ((= x (entry set)) set)
        ((&lt; x (entry set))
         (make-tree 
          (entry set)
          (adjoin-set x (left-branch set))
          (right-branch set)))
        ((&gt; x (entry set))
         (make-tree
          (entry set)
          (left-branch set)
          (adjoin-set x (right-branch set))))))
</pre>
</div>

<p>
Adjoining an item in this way requires \(\Theta(\log n)\) steps.
</p>
</div>

<div id="outline-container-org80b54d3" class="outline-3">
<h3 id="org80b54d3">Exercise 2.63</h3>
<div class="outline-text-3" id="text-org80b54d3">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
Each of the following two procedures converts a binary tree to a list.
</p>

<pre class="example">
(define (tree-&gt;list-1 tree)
  (if (null? tree)
      '()
      (append 
       (tree-&gt;list-1 
        (left-branch tree))
       (cons (entry tree)
             (tree-&gt;list-1 
              (right-branch tree))))))

(define (tree-&gt;list-2 tree)
  (define (copy-to-list tree result-list)
    (if (null? tree)
        result-list
        (copy-to-list 
         (left-branch tree)
         (cons (entry tree)
               (copy-to-list 
                (right-branch tree)
                result-list)))))
  (copy-to-list tree '()))
</pre>

<ol class="org-ol">
<li>Do the two procedures produce the same result for every tree? If
not, how do the results differ? What lists do the two procedures
produce for the trees in Figure 2.16?</li>
<li>Do the two procedures have the same order of growth in the number
of steps required to convert a balanced tree with \(n\) elements to a
list? If not, which one grows more slowly?</li>
</ol>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">entry</span> tree) (car tree))
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">left-branch</span> tree) (cadr tree))
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">right-branch</span> tree) (caddr tree))
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">make-tree</span> entry left right)
  (list entry left right))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">element-of-set?</span> x set)
  (<span style="color: #b9ca4a;">cond</span> ((null? set) false)
        ((= x (entry set)) true)
        ((&lt; x (entry set))
         (element-of-set?
          x
          (left-branch set)))
        ((&gt; x (entry set))
         (element-of-set?
          x
          (right-branch set)))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">adjoin-set</span> x set)
  (<span style="color: #b9ca4a;">cond</span> ((null? set) (make-tree x '() '()))
        ((= x (entry set)) set)
        ((&lt; x (entry set))
         (make-tree
          (entry set)
          (adjoin-set x (left-branch set))
          (right-branch set)))
        ((&gt; x (entry set))
         (make-tree
          (entry set)
          (left-branch set)
          (adjoin-set x (right-branch set))))))


(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">tree-&gt;list-1</span> tree)
  (<span style="color: #b9ca4a;">if</span> (null? tree)
      '()
      (append
       (tree-&gt;list-1
        (left-branch tree))
       (cons (entry tree)
             (tree-&gt;list-1
              (right-branch tree))))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">tree-&gt;list-2</span> tree)
  (<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">copy-to-list</span> tree result-list)
    (<span style="color: #b9ca4a;">if</span> (null? tree)
        result-list
        (copy-to-list
         (left-branch tree)
         (cons (entry tree)
               (copy-to-list
                (right-branch tree)
                result-list)))))
  (copy-to-list tree '()))

(tree-&gt;list-1 (make-tree 7
                         (make-tree 3
                                    (make-tree 1 nil nil)
                                    (make-tree 5 nil nil))
                         (make-tree 9
                                    nil
                                    (make-tree 11 nil nil))))
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt; (1 3 5 7 9 11)</span>

(tree-&gt;list-2 (make-tree 7
                         (make-tree 3
                                    (make-tree 1 nil nil)
                                    (make-tree 5 nil nil))
                         (make-tree 9
                                    nil
                                    (make-tree 11 nil nil))))
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt; (1 3 5 7 9 11)</span>

(tree-&gt;list-1 (make-tree 3
                         (make-tree 1 nil nil)
                         (make-tree 7
                                    (make-tree 5 nil nil)
                                    (make-tree 9
                                               nil
                                               (make-tree 11 nil nil)))))
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt; (1 3 5 7 9 11)</span>

(tree-&gt;list-2 (make-tree 3
                         (make-tree 1 nil nil)
                         (make-tree 7
                                    (make-tree 5 nil nil)
                                    (make-tree 9
                                               nil
                                               (make-tree 11 nil nil)))))
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt; (1 3 5 7 9 11)</span>

(tree-&gt;list-1 (make-tree 5
                         (make-tree 3
                                    (make-tree 1 nil nil)
                                    nil)
                         (make-tree 9
                                    (make-tree 7 nil nil)
                                    (make-tree 11 nil nil))))
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt; (1 3 5 7 9 11)</span>

(tree-&gt;list-2 (make-tree 5
                         (make-tree 3
                                    (make-tree 1 nil nil)
                                    nil)
                         (make-tree 9
                                    (make-tree 7 nil nil)
                                    (make-tree 11 nil nil))))
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt; (1 3 5 7 9 11)</span>

</pre>
</div>

<p>
It looks like tree-&gt;list-1 and tree-&gt;list-2 give always the same
result.
</p>

<p>
In time, they seem to grow at the same pace (Are you sure? Doesn't the
append in tree-&gt;list-1 makes it grow faster?).
</p>

<p>
In space, tree-&gt;list-2 seems to grow more slowly, because one the two
recursive calls is a tail call (scheme optimizes in that case).
</p>
</div>
</div>
