blog/19.org
** Exercise 2.64
*Exercise*:

#+begin_quote
The following procedure ~list->tree~ converts an ordered list to a
balanced binary tree. The helper procedure ~partial-tree~ takes as
arguments an integer $n$ and list of at least $n$ elements and
constructs a balanced tree containing the first $n$ elements of the
list. The result returned by ~partial-tree~ is a pair (formed with
cons) whose ~car~ is the constructed tree and whose ~cdr~ is the list
of elements not included in the tree.

#+begin_src scheme
  (define (list->tree elements)
    (car (partial-tree 
          elements (length elements))))

  (define (partial-tree elts n)
    (if (= n 0)
        (cons '() elts)
        (let ((left-size 
               (quotient (- n 1) 2)))
          (let ((left-result 
                 (partial-tree 
                  elts left-size)))
            (let ((left-tree 
                   (car left-result))
                  (non-left-elts 
                   (cdr left-result))
                  (right-size 
                   (- n (+ left-size 1))))
              (let ((this-entry 
                     (car non-left-elts))
                    (right-result 
                     (partial-tree 
                      (cdr non-left-elts)
                      right-size)))
                (let ((right-tree 
                       (car right-result))
                      (remaining-elts 
                       (cdr right-result)))
                  (cons (make-tree this-entry 
                                   left-tree 
                                   right-tree)
                        remaining-elts))))))))
#+end_src

1. Write a short paragraph explaining as clearly as you can how
   ~partial-tree~ works. Draw the tree produced by ~list->tree~ for
   the list (1 3 5 7 9 11).
2. What is the order of growth in the number of steps required by
   ~list->tree~ to convert a list of n elements?
#+end_quote

*Answer*:

I've done quite a horrible job, but here it is:

The function applies a recursive strategy. The central element of the
list given will be the entry of the tree. The central element is the
element whose index is the quotient of ~(- n 1)~ and ~2~, where n is
the length of the list. Then the left and the right branch are
computed. The left branch is the car of ~left-result~, that is, the
result of the recursive call (~partial-tree~) applied to the original
list and the quotient of ~(- n 1)~ and ~2~. The result of this latter
recursive call is needed in order for computing the right branch as
well. For the right tree is the car of ~right-result~, that is, the
recursive call (~partial-tree~) applied to the ~cdr~ of ~left-result~
and $(- n (+ left-size 1)$. The terminal case of partial-tree is
represented by when n is 0. In that case the empty list is consed onto
the given list.

The tree produced by ~(list->tree '(1 3 5 7 9 11))~ is:

#+begin_src
      5
    /   \
   /     \
  /       \
 /         \
1           9
 \         / \
  \       /   \
   3     7    11
#+end_src


2. The order of growth is linear.

** Exercise 2.65
#+begin_quote
Use the results of Exercise 2.63 and Exercise 2.64 to give $\Theta(n)$
implementations of ~union-set~ and ~intersection-set~ for sets
implemented as (balanced) binary trees.
#+end_quote

*Answer*:

We already have a ~union-set~ (from ex 2.62) and an ~intersection-set~
(presented by the authors) /which work with ordered lists/ and have a
linear --- $\Theta(n)$ --- order of growth.

So, assuming that the value of the application of ~tree->list-1~ (or
~tree->list-2~) is an ordered list, we can compute the union for sets
implemented as binary trees (let's calle it ~union-set-bt~) as
follows::

#+begin_src scheme
  (define (union-set-bt set1 set2)
    (list->tree (union-set (tree->list-1 set1)
                           (tree->list-1 set2)))
#+end_src

#+begin_src scheme
  (define (intersection-set-bt set1 set2)
    (list->tree (intersection-set (tree->list-1 set1)
                                  (tree->list-1 set2)))
#+end_src

The order of growth of the processes evolved by ~union-set-bt~ and
~intersection-set-bt~ procedures is linear because ~list->tree~,
~union-set~ and ~tree->list-1~ (we could have alternatively used
~tree-list-2~) all evolve processes with linear order of growth.

Now, if we have to drop the assumption that the application of
~tree->lits1/2~ is going to be ordered, we can order the lists using a
sorting procedure with an order of growth of $\Theta(n)$ or less, for
example an implementation of merge sort. Given so, ~union-set-bt~ and
~intersection-set-bt~ would look as follow and would still be linear:

#+begin_src scheme
  (define (union-set-bt set1 set2)
    (list->tree (union-set (sort (tree->list-1 set1))
                           (sort (tree->list-1 set2))))
#+end_src

#+begin_src scheme
  (define (intersection-set-bt set1 set2)
    (list->tree (intersection-set (sort (tree->list-1 set1))
                                  (sort ((tree->list-1 set2))))
#+end_src

