blog/19.html

<div id="outline-container-org8fb43b6" class="outline-3">
<h3 id="org8fb43b6">Exercise 2.64</h3>
<div class="outline-text-3" id="text-org8fb43b6">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
The following procedure <code>list-&gt;tree</code> converts an ordered list to a
balanced binary tree. The helper procedure <code>partial-tree</code> takes as
arguments an integer \(n\) and list of at least \(n\) elements and
constructs a balanced tree containing the first \(n\) elements of the
list. The result returned by <code>partial-tree</code> is a pair (formed with
cons) whose <code>car</code> is the constructed tree and whose <code>cdr</code> is the list
of elements not included in the tree.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">list-&gt;tree</span> elements)
  (car (partial-tree 
        elements (length elements))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">partial-tree</span> elts n)
  (<span style="color: #b9ca4a;">if</span> (= n 0)
      (cons '() elts)
      (<span style="color: #b9ca4a;">let</span> ((left-size 
             (quotient (- n 1) 2)))
        (<span style="color: #b9ca4a;">let</span> ((left-result 
               (partial-tree 
                elts left-size)))
          (<span style="color: #b9ca4a;">let</span> ((left-tree 
                 (car left-result))
                (non-left-elts 
                 (cdr left-result))
                (right-size 
                 (- n (+ left-size 1))))
            (<span style="color: #b9ca4a;">let</span> ((this-entry 
                   (car non-left-elts))
                  (right-result 
                   (partial-tree 
                    (cdr non-left-elts)
                    right-size)))
              (<span style="color: #b9ca4a;">let</span> ((right-tree 
                     (car right-result))
                    (remaining-elts 
                     (cdr right-result)))
                (cons (make-tree this-entry 
                                 left-tree 
                                 right-tree)
                      remaining-elts))))))))
</pre>
</div>

<ol class="org-ol">
<li>Write a short paragraph explaining as clearly as you can how
<code>partial-tree</code> works. Draw the tree produced by <code>list-&gt;tree</code> for
the list (1 3 5 7 9 11).</li>
<li>What is the order of growth in the number of steps required by
<code>list-&gt;tree</code> to convert a list of n elements?</li>
</ol>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
I've done quite a horrible job, but here it is:
</p>

<p>
The function applies a recursive strategy. The central element of the
list given will be the entry of the tree. The central element is the
element whose index is the quotient of <code>(- n 1)</code> and <code>2</code>, where n is
the length of the list. Then the left and the right branch are
computed. The left branch is the car of <code>left-result</code>, that is, the
result of the recursive call (<code>partial-tree</code>) applied to the original
list and the quotient of <code>(- n 1)</code> and <code>2</code>. The result of this latter
recursive call is needed in order for computing the right branch as
well. For the right tree is the car of <code>right-result</code>, that is, the
recursive call (<code>partial-tree</code>) applied to the <code>cdr</code> of <code>left-result</code>
and \((- n (+ left-size 1)\). The terminal case of partial-tree is
represented by when n is 0. In that case the empty list is consed onto
the given list.
</p>

<p>
The tree produced by <code>(list-&gt;tree '(1 3 5 7 9 11))</code> is:
</p>

<pre class="example">
      5
    /   \
   /     \
  /       \
 /         \
1           9
 \         / \
  \       /   \
   3     7    11
</pre>


<ol class="org-ol">
<li>The order of growth is linear.</li>
</ol>
</div>
</div>

<div id="outline-container-org0ee8d9a" class="outline-3">
<h3 id="org0ee8d9a">Exercise 2.65</h3>
<div class="outline-text-3" id="text-org0ee8d9a">
<blockquote>
<p>
Use the results of Exercise 2.63 and Exercise 2.64 to give \(\Theta(n)\)
implementations of <code>union-set</code> and <code>intersection-set</code> for sets
implemented as (balanced) binary trees.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
We already have a <code>union-set</code> (from ex 2.62) and an <code>intersection-set</code>
(presented by the authors) <i>which work with ordered lists</i> and have a
linear &#x2014; \(\Theta(n)\) &#x2014; order of growth.
</p>

<p>
So, assuming that the value of the application of <code>tree-&gt;list-1</code> (or
<code>tree-&gt;list-2</code>) is an ordered list, we can compute the union for sets
implemented as binary trees (let's calle it <code>union-set-bt</code>) as
follows::
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">union-set-bt</span> set1 set2)
  (list-&gt;tree (union-set (tree-&gt;list-1 set1)
                         (tree-&gt;list-1 set2)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">intersection-set-bt</span> set1 set2)
  (list-&gt;tree (intersection-set (tree-&gt;list-1 set1)
                                (tree-&gt;list-1 set2)))
</pre>
</div>

<p>
The order of growth of the processes evolved by <code>union-set-bt</code> and
<code>intersection-set-bt</code> procedures is linear because <code>list-&gt;tree</code>,
<code>union-set</code> and <code>tree-&gt;list-1</code> (we could have alternatively used
<code>tree-list-2</code>) all evolve processes with linear order of growth.
</p>

<p>
Now, if we have to drop the assumption that the application of
<code>tree-&gt;lits1/2</code> is going to be ordered, we can order the lists using a
sorting procedure with an order of growth of \(\Theta(n)\) or less, for
example an implementation of merge sort. Given so, <code>union-set-bt</code> and
<code>intersection-set-bt</code> would look as follow and would still be linear:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">union-set-bt</span> set1 set2)
  (list-&gt;tree (union-set (sort (tree-&gt;list-1 set1))
                         (sort (tree-&gt;list-1 set2))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">intersection-set-bt</span> set1 set2)
  (list-&gt;tree (intersection-set (sort (tree-&gt;list-1 set1))
                                (sort ((tree-&gt;list-1 set2))))
</pre>
</div>
</div>
</div>
